app/controllers/products_controller.rb

 def show
   @products = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

 def search
  @products = Product.where('title like(?)', "%#{params[:keyword]}%").limit(20)
---
SELECT `products`.* FROM `products` WHERE (title like('%少女%')) LIMIT 20